Revit 2027 API
NumberingSchema.SetPartitioningParameters Method
 Set the set of parameters used by this numbering schema to segregate a set of elements to a separate set of element where matching and numbering will be performed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartitioningParameters(
	ISet<NumberingParameter> partitioningParameters
)
Public Sub SetPartitioningParameters (
	partitioningParameters As ISet(Of NumberingParameter)
)
public:
void SetPartitioningParameters(
	ISet<NumberingParameter^>^ partitioningParameters
)
member SetPartitioningParameters :
        partitioningParameters : ISet<NumberingParameter> -> unit
Parameters
partitioningParameters ISet<NumberingParameter>
 The set of parameters used to divide elements into separate partitions for independent numbering.
Exceptions
Exception | Condition
ArgumentException |  The input parameters are not valid for use in partitioning for numbering.
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace